ErpTest/src/DataProcessors/пкСостояниеТехники/пкСостояниеТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>пкСостояниеТехники</name>
  <comment>Рарус</comment>
</mdclass:DataProcessor>

ErpTest/src/Enums/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыТехники</name>
  <enumValues>
    <name>НаБазе</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>КВозврату</name>
  </enumValues>
  <enumValues>
    <name>Недоступен</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкСтатусыРемонтаТехники/пкСтатусыРемонтаТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыРемонтаТехники</name>
  <enumValues>
    <name>КРемонту</name>
  </enumValues>
  <enumValues>
    <name>ВРемонте</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/DataProcessors/пкСостояниеТехники/Forms/Форма/Module.bsl
&НаКлиенте
Процедура МодельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    
    Отбор = Новый Структура("пкЭтоТехника", Истина);
    
    ПараметрыФормы = Новый Структура("Отбор", Отбор);
    
    ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, , , , , Новый ОписаниеОповещения("МодельНачалоВыбораЗавершение", ЭтаФорма));
    
КонецПроцедуры

&НаКлиенте
Процедура МодельНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
    
    Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
        Модель = ВыбранноеЗначение; 
        
        Если ЗначениеЗаполнено(Модель) Тогда
            ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
                СписокТехники, "Модель", Модель, , , Истина);
        Иначе
            ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
                СписокТехники, "Модель", , , , Ложь);
        КонецЕсли;        
    КонецЕсли;    
    
КонецПроцедуры  
    
&НаКлиенте
Процедура МодельПриИзменении(Элемент)
    
    Если ЗначениеЗаполнено(Подразделение) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Модель", Модель, , , Истина);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Модель", , , , Ложь);
    КонецЕсли;    
    
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
    
    Если ЗначениеЗаполнено(Подразделение) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Подразделение", Подразделение, , , Истина);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Подразделение", , , , Ложь);
    КонецЕсли;    
        
КонецПроцедуры

&НаКлиенте
Процедура МестонахожденияПриИзменении(Элемент)
    
    Если ЗначениеЗаполнено(Местонахождения) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Местонахождения", Местонахождения, , , Истина);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Местонахождения", , , , Ложь);
    КонецЕсли; 
        
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусамТехникиПриИзменении(Элемент)
    
    УстановитьОтборПоСтатусамТехникиНаСервере();
        
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСтатусамТехникиНаСервере()
        
    Если ОтборПоСтатусамТехники = 0 Тогда
                
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "Статус", Перечисления.пкСтатусыТехники.НаБазе, , , Истина);
            
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "СтатусРемонта", , , , Ложь);
        
    ИначеЕсли ОтборПоСтатусамТехники = 1 Тогда
        
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "Статус", , , , Ложь);
            
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "СтатусРемонта", Перечисления.пкСтатусыРемонтаТехники.ВРемонте, , , Истина);

        
    ИначеЕсли ОтборПоСтатусамТехники = 2 Тогда
        
        СписокСтатусов = Новый СписокЗначений();

        СписокСтатусов.Добавить(Перечисления.пкСтатусыТехники.ВПути);
        СписокСтатусов.Добавить(Перечисления.пкСтатусыТехники.КОтгрузке);
        СписокСтатусов.Добавить(Перечисления.пкСтатусыТехники.ВАренде);
        СписокСтатусов.Добавить(Перечисления.пкСтатусыТехники.КВозврату);
        
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "Статус", СписокСтатусов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
            
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "СтатусРемонта", , , , Ложь);
        
    Иначе
        
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "Статус", , , , Ложь);
            
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    СписокТехники, "СтатусРемонта", , , , Ложь);
            
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    УстановитьОтборПоСтатусамТехникиНаСервере();
    
    Подразделение = Пользователи.ТекущийПользователь().Подразделение;
    
    Если ЗначениеЗаполнено(Подразделение) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
            СписокТехники, "Подразделение", Подразделение, , , Истина);
    КонецЕсли;        
        
КонецПроцедуры
